---
kind: type
id: T:Autodesk.Revit.DB.MEPFamilyConnectorInfo
source: html/6870182d-9c09-59ec-5c74-e9472589527a.htm
---
# Autodesk.Revit.DB.MEPFamilyConnectorInfo

MEP family connector information.

## Syntax (C#)
```csharp
public class MEPFamilyConnectorInfo : MEPConnectorInfo
```